read_liberty -lib sky130_fd_sc_hd__tt_025C_1v80.lib
read_verilog ha.v fa.v csa.v
synth -top csa
#dfflibmap -liberty sky130_fd_sc_hd__tt_025C_1v80.lib
abc -liberty sky130_fd_sc_hd__tt_025C_1v80.lib
clean
flatten
write_verilog -noattr synth.v
tee -o report_csa.txt stat -liberty sky130_fd_sc_hd__tt_025C_1v80.lib
